# CRUID in database
* create
* read
* update 
* insert
* delete

# Connect and create to  a new database

In [1]:
import sqlite3

In [2]:
con = sqlite3.connect('std.db')

# we need cursor to execute sql query

In [3]:
cur= con.cursor()

# creating table in SQL

```sql

create table table_name (roll_no int, name varchar(20), address varchar(50)



```

In [6]:
create_table = '''
Create table student(roll_no int not null,
name varchar(20),
address varchar(50))
'''

In [7]:
cur.execute(create_table)

# Insert statement in sql

```sql
INSERT INTO TABLE(COL_1, COL_2....COL_N)
VALUES
(VAL_1, VAL_2 , ...., VAL_N)
```

In [10]:
insert_data ='''
insert into student
(roll_no,name,address)
values
(1,'shraddha','patan'),
(2,"prakash", 'kathmandu'),
(3,'ram','bhaktapur')
'''

In [11]:
cur.execute(insert_data)

# Read in SQL/ Select statement in sql
```sql

select * from table_name

```

In [12]:
read_query='''
select * from student

'''

In [13]:
cur.execute(read_query)

In [14]:
cur.execute(read_query).fetchall()

[(1, 'shraddha', 'patan'),
 (2, 'prakash', 'kathmandu'),
 (3, 'ram', 'bhaktapur')]

In [15]:
query = '''
select name from student
where roll_no = 2 
'''

In [16]:
cur.execute(query).fetchall()

[('prakash',)]

In [23]:
query = '''
select name from student
where address = "patan" 
'''

In [24]:
cur.execute(query).fetchall()

[('shraddha',)]

# find the name of people who lives in patan

In [29]:
cur.execute('select name,roll_no from student where address ="patan"').fetchall()

[('shraddha', 1)]

# Update in SQL

```sql

update table_name
set col_name = val
where
condition1

```

In [30]:
query = """
update student
set name ='Shraddha Joshi'
where
roll_no = 1
"""

In [31]:
cur.execute(query)

In [32]:
cur.execute("select * from student").fetchall()

[(1, 'Shraddha Joshi', 'patan'),
 (2, 'prakash', 'kathmandu'),
 (3, 'ram', 'bhaktapur')]

# delete in SQL

In [33]:
cur.execute("delete from student where roll_no = 1")

In [34]:
cur.execute("select * from student").fetchall()

[(2, 'prakash', 'kathmandu'), (3, 'ram', 'bhaktapur')]